src/main/resources/ws_soap_requests/AT1300-40090-MC10.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Header>
        <Credentials xmlns="http://Airspan.Netspan.WebServices">
            <Username>wsadmin</Username>
            <Password>password</Password>
        </Credentials>
    </soap:Header>
    <soap:Body>
        <RadioProfileUpdate xmlns="http://Airspan.Netspan.WebServices">
            <Name>AT1300-40090-MC10</Name>
            <RadioProfile>
                <Name>AT1300-40090-MC10</Name>
                <HardwareCategory>AirSpeed</HardwareCategory>
                <CbrsEnabled>0</CbrsEnabled>
                <Earfcn>40090</Earfcn>
                <Band>41</Band>
                <DuplexMode>TDD</DuplexMode>
                <BandwidthMhz>10</BandwidthMhz>
                <FrameConfig>DL60UL20SP20</FrameConfig>
                <TxPower>20</TxPower>
                <SsfType>SSF7</SsfType>
            </RadioProfile>
        </RadioProfileUpdate>
    </soap:Body>
</soap:Envelope>